Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateCutoutWarn Property
 Can't make cut-out.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateCutoutWarn { get; }
Public Shared ReadOnly Property CannotCreateCutoutWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateCutoutWarn {
	FailureDefinitionId^ get ();
}
static member CannotCreateCutoutWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace